** First Steps
 The /very/ first piece of syntax we're going to introduce in Javascript is how to print out values within a program. 

 Write the following lines of code in a file called ~FirstSteps.js~.
 #+BEGIN_SRC js :exports code :results output :tangle FirstSteps.js
   console.log(10);
   console.log(100);
   console.log(300);
 #+END_SRC

 #+RESULTS:
 : 10
 : 100
 : 300

If you run this file using the following command you should see the output indicated.
#+BEGIN_SRC sh :exports both :results output
  node FirstSteps.js
#+END_SRC

#+RESULTS:
: 10
: 100
: 300

We need to discuss what's happened here. First off, we've introduced the syntax ~console.log(v)~, whose semantics is to print out to the console the value of its argument, this means that it prints out the result of Javascript evaluating ~v~ and not just the literal syntax of ~v~ as we'll see shortly. This will be very useful for us in testing out our programs and checking that we understand the semantics of our constructs.

The second piece of syntax we've implicitly introduced is the /semi-colon/ and the /line break/. Javascript separates its syntax into /statements/ and /expressions/. We'll make more clear what the distinction between these two, but at first let's just say that statements are things that are separated by lines and expressions are things that can be fed as arguments. So, for example, ~10~ and ~console.log(10)~ are expressions but ~console.log(10);~ is a statement. For readability it's best to put statements on new lines, even though technically you could have written the above code as 

#+BEGIN_SRC js :exports code :results output 
  console.log(10);console.log(100);console.log(300);
#+END_SRC

but this isn't recommended as it makes code much harder to read.[fn:4]

Some other languages that use semicolons are Java, C, C++, C#, and PHP. The use of semicolons is one of those historic conventions that's good for the person writing the implementation of the programming language, but less so for the programmers who need to work in that language. Going back to our analogy about recipes, think of an expression as a thing like "a cup of flour" or "six onions" but a /statement/ is a step in the recipe such as "sautee six onions until soft". So in the example above each line that has ~console.log(v);~ in it is a separate statement that is executed in order, just like you'd execute the steps of a recipe in order. 

Now that we have a way to print out values and are starting to understand the difference between expressions and statements, we can start introducing operations on numbers as a first step. We have in JavaScript all the basic operations you're familiar with, including +,*, and -. We can see how they work in the following code, which you can copy into a file called ArithmeticExpressions.js

#+BEGIN_SRC js :exports code :results output  :tangle ArithmeticExpressions.js
  console.log(10 + 10);
  console.log(10 * 10);
  console.log(10 - 10);
  console.log(10 / 10);
#+END_SRC

#+RESULTS:
: 20
: 100
: 0
: 1

If you run this code with the following snippet then you should see the same results as below.

#+BEGIN_SRC sh :exports both :results output
  node ArithmeticExpressions.js
#+END_SRC

#+RESULTS:
: 20
: 100
: 0
: 1

It's important to note that the number that's printed out is the /result/ of the expression that's passed into the ~console.log~. 
